{
  "model_type": "continuous_diffusion_lm",
  "architectures": [
    "ContinuousDiffusionLanguageModel"
  ],
  "hidden_size": 384,
  "num_hidden_layers": 6,
  "num_attention_heads": 6,
  "intermediate_size": 1536,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "attention_probs_dropout_prob": 0.1,
  "initializer_range": 0.02,
  "layer_norm_eps": 1e-05,
  "vocab_size": 1,
  "max_position_embeddings": 1024,
  "n_positions": 1024,
  "num_diffusion_steps": 50,
  "diffusion_schedule": "linear",
  "noise_scale": 1.0,
  "learning_rate": 0.0001,
  "use_cache": false
}
